Tekla Open API Reference for Tekla Structures 2025
StraightDimension.StraightDimensionAttributes.DimensionValuePostfix Property
 The postfix for the dimension's value.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ContainerElement DimensionValuePostfix { get; set; }
Public Property DimensionValuePostfix As ContainerElement
	Get
	Set
Property Value
Type: ContainerElement
See Also
Reference
StraightDimension.StraightDimensionAttributes Class
Tekla.Structures.Drawing Namespace